{"keras_version": "2.0.3", "backend": "tensorflow", "config": {"input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["dense_6", 0, 0]], "layers": [{"name": "input_3", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_3", "sparse": false}, "class_name": "InputLayer"}, {"name": "conv2d_9", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"name": "max_pooling2d_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_7", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.25, "name": "dropout_7"}, "class_name": "Dropout"}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_11", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_12", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"name": "max_pooling2d_6", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_6", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_8", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.25, "name": "dropout_8"}, "class_name": "Dropout"}, {"name": "flatten_3", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3"}, "class_name": "Flatten"}, {"name": "dense_5", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "dense_5", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512}, "class_name": "Dense"}, {"name": "dropout_9", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_9"}, "class_name": "Dropout"}, {"name": "dense_6", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "name": "dense_6", "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 17}, "class_name": "Dense"}]}, "class_name": "Model"}