{"keras_version": "2.0.4", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_4", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_2"}, "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 32, "name": "conv2d_5"}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 32, "name": "conv2d_6"}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_4"}, "name": "dropout_4"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "name": "conv2d_7"}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "name": "conv2d_8"}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4"}, "name": "max_pooling2d_4"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_5"}, "name": "dropout_5"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 512, "name": "dense_3", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "dense_3"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}, "name": "dropout_6"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 17, "name": "dense_4", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "dense_4"}], "name": "model_2"}}