{"backend": "tensorflow", "config": {"output_layers": [["dense_4", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "name": "conv2d_6", "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}, "class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "name": "conv2d_7", "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "name": "conv2d_8", "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_5"}, "class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "trainable": true, "activation": "relu", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_6"}, "class_name": "Dropout", "name": "dropout_6", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 17, "trainable": true, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.0.3"}