{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4", "config": {"name": "model_3", "output_layers": [["dense_6", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "input_3", "dtype": "float32"}, "name": "input_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_9"}, "name": "conv2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_10"}, "name": "conv2d_10"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_5", "strides": [2, 2]}, "name": "max_pooling2d_5"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_7", "rate": 0.25}, "name": "dropout_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_11"}, "name": "conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_12"}, "name": "conv2d_12"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_6", "strides": [2, 2]}, "name": "max_pooling2d_6"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_8", "rate": 0.25}, "name": "dropout_8"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"name": "flatten_3", "trainable": true}, "name": "flatten_3"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "units": 512, "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "dense_5"}, "name": "dense_5"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}, "name": "dropout_9"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "units": 17, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "dense_6"}, "name": "dense_6"}], "input_layers": [["input_3", 0, 0]]}}