{"config": {"name": "model_2", "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_2", "config": {"name": "input_2", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_5", "config": {"filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_5", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_6", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"filters": 64, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_7", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"filters": 64, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_8", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dense_3", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "name": "dense_3", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 512}, "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dropout_6", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_4", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "sigmoid", "name": "dense_4", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 17}, "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Model"}