{"config": {"name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"filters": 64, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_3", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"filters": 64, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "trainable": true, "name": "conv2d_4", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "name": "dense_1", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 512}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "sigmoid", "name": "dense_2", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 17}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Model"}