{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_3"}, "inbound_nodes": []}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.25}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_size": [3, 3], "bias_constraint": null, "filters": 64, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_size": [3, 3], "bias_constraint": null, "filters": 64, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.25}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 512, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 17, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}], "output_layers": [["dense_6", 0, 0]], "input_layers": [["input_3", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow"}