{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_1", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "use_bias": true, "padding": "same", "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "use_bias": true, "padding": "same", "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_3", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "use_bias": true, "padding": "same", "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_4", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "use_bias": true, "padding": "same", "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"trainable": true, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 17, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null}}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}}