{"config": {"name": "model_3", "output_layers": [["dense_6", 0, 0]], "input_layers": [["input_3", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_3", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_3"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"config": {"trainable": true, "name": "dropout_7", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "dropout_7"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "conv2d_11"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "conv2d_12"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"config": {"trainable": true, "name": "dropout_8", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "dropout_8"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "flatten_3"}, {"config": {"units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_5"}, {"config": {"trainable": true, "name": "dropout_9", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dropout_9"}, {"config": {"units": 4, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dense_6"}]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}