{"config": {"name": "model_2", "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_2", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "dropout_4"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "dropout_5"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "flatten_2"}, {"config": {"units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_3"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_6"}, {"config": {"units": 4, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_4"}]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}