{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_2", "sparse": false}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_5", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_6", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_7", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_8", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"name": "dropout_5", "trainable": true, "rate": 0.25}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null}}, {"name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dropout_6", "trainable": true, "rate": 0.5}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 13, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null}}]}, "keras_version": "2.0.3"}